local L = LibStub("AceLocale-3.0"):NewLocale("EquipSwitcher", "zhTW", true)
if not L then return end

L["一键换装"] = "一鍵換裝"
L["一键换装设置面板"] = "一鍵換裝設置窗口"
L["为当前套装重新命名一个名字"] = "為當前套裝重新命名"
L["保存"] = "儲存"
L["保存套装"] = "儲存套裝"
L["保存当前套装"] = "儲存當前套裝"
L["加载当前装备数据"] = "加載當前裝備數據"
L["启用快速换装条"] = "啟用快速換裝條"
L["在玩家头像上方显示快速换装条"] = "在玩家頭像上方顯示快速換裝條"
L["套装%d"] = "套裝%d"
L["当前套装: %s"] = "當前套裝: %s"
L["当前配置是否需要保存在|cffffd200%s|r中?"] = "當前配置是否需要保存在|cffffd200%s|r中?"
L["快速换装"] = "快速換裝"
L["无法装备%s"] = true
L["是否需要重置|cffffd200%s|r的配置?"] = "是否需要重置|cffffd200%s|r的配置?"
L["显示换装按钮"] = "顯示換裝按鈕"
L["点击选择'%s'查看当前配置, 你还可以进行保存, 重命名, 设定快捷键以及重置."] = "點擊選擇'%s'查看當前配置, 你還可以進行保存, 重命名, 設定快捷鍵以及重置"
L["设置后点击“套装”按钮保存当前配置, 并且不要忘记设定快捷键哦"] = "設置后點擊\"套裝\"按鈕保存當前配置."
L["设置换装条 X"] = "設置換裝條 X"
L["设置换装条X轴显示位置"] = "設置換裝條X軸顯示位置"
L["设置换装条Y"] = "設定換裝條Y"
L["设置换装条Y轴显示位置"] = "設置換裝條Y軸顯示位置"
L["设置换装条显示按钮个数"] = "設置換裝條顯示按鈕個數"
L["设置面板"] = "設定面板"
L["读取当前装备"] = "讀取當前裝備"
L["重命名"] = "重命名"
L["重置"] = "重置"
L["重置当前套装配置"] = "重置當前套裝配置"

L["设定快捷键"] = "設定快捷鍵"
L["按键绑定"] = "按鍵綁定"
L["为当前套装设定按键绑定, 绑定后请按回车以确认.\n按ESC键清除按键绑定"] = "為當前套裝設定按鍵綁定, 綁定后請按回車以確認!\n按ESC鍵清除/取消按鍵綁定";
L["一键换装按键1"] = "一鍵換裝按键1"
L["一键换装按键2"] = "一鍵換裝按键2"
L["一键换装按键3"] = "一鍵換裝按键3"
L["一键换装按键4"] = "一鍵換裝按键4"
L["一键换装按键5"] = "一鍵換裝按键5"
L["一键换装按键6"] = "一鍵換裝按键6"
L["一键换装按键7"] = "一鍵換裝按键7"
L["一键换装按键8"] = "一鍵換裝按键8"

L["装备%s不存在!"] = "裝備%s不存在!";
L["点击打开设置面板"] = "點擊打開設置界面";

L["启用"] = "啟用"
L["启用/禁用一键换装插件"] = "啟用/禁用一鍵換裝插件"
L["启用事件换装"] = "啟用事件換裝"
L["启用/禁用事件换装"] = "啟用/禁用事件換裝"

L["套装"] = "套裝"