------------------------------------------------------------------------------------------
-- ChangeLog ver 1.0
-- 日期: 2010-4-3
-- 作者: dugu
-- 描述: 多玩魔盒更新日志信息(简体中文)
-- 版权所有 (c) duowan.com
------------------------------------------------------------------------------------------
DUOWAN_CHANGELOG = "";

function HTML_BEGIN()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<HTML><BODY>";
end

function HTML_TITLE(txt)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H1>" .. txt .. "</H1>";
end

function HTML_VER(ver)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H2>" .. ver .. "</H2>";
end

function HTML_SPACE()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG .. "<BR/>";
end

function HTML_LOG(head, desc)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<P>|cff00e0e0" .. head .. ": |R" .. desc .. "</P>";
end

function HTML_END()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "</BODY></HTML>";
end


if (GetLocale() == "zhCN") then
	HTML_BEGIN();
		HTML_TITLE("更新日志:");
		HTML_VER("2011-05-4(3.3.0.43");
		HTML_LOG("副本掉落", "增加红玉圣殿副本掉落查询");
		HTML_LOG("增益魔法", "可以自己设置BUFF的尺寸了");
		HTML_LOG("快速标记", "快速标记现在可以正确关闭了");
		HTML_LOG("聊天增强", "尝试修正聊天栏职业着色错误");
		HTML_LOG("副本掉落", "恢复小地图快捷按钮");

		HTML_VER("2011-05-3(3.3.0.42");
		HTML_LOG("头像增强", "修正队友等级不即时刷新的错误");
		HTML_LOG("BUFF计时", "微调目标BUFF计时字体大小");

		HTML_VER("2011-05-1(3.3.0.41");
		HTML_LOG("头像增强", "增加显示隐藏队友BUFF选项");
		HTML_LOG("首领模块", "增加监控团队技能冷却模块");
		HTML_LOG("魔法增益", "缺省将显示目标BUFF计时");
		HTML_LOG("聊天增强", "转发频道将不再显示转发人");
		HTML_LOG("地图增强", "增加稀有精英探测模块");

		HTML_VER("2011-04-24(3.3.0.40");
		HTML_LOG("随机坐骑", "修正可能出现小鸟的坑爹问题");
		HTML_LOG("头像增强", "修正队友的目标显示错误问题");

		HTML_VER("2011-04-22(3.3.0.39");
		HTML_LOG("多玩移动", "更名为多玩界面");
		HTML_LOG("多玩移动", "调整界面方式更加直观");
		HTML_LOG("多玩魔盒", "优化多玩魔盒内存占用");
		HTML_LOG("物品咨询", "缺省不再开启使用在树状列表");
		HTML_LOG("多玩魔盒", "优化解决战斗中卡载具的方案");
		HTML_LOG("猎人助手", "修复自动切换追踪技能的错误");
		HTML_LOG("随机坐骑", "修复可能使用低级坐骑的错误");
		HTML_LOG("随机坐骑", "优化在冬拥湖使用坐骑的判定");
		HTML_LOG("多玩魔盒", "精简基本库非必要的库文件");
		HTML_LOG("任务增强", "优化任务监视栏的缺省定位");
		HTML_LOG("任务增强", "魔盒将缺省为你选择最贵奖品");
		HTML_LOG("首领模块", "增加首领模块计时条移动选项");
		HTML_LOG("多玩界面", "修正主动作条定位偏移错误");
		HTML_LOG("魔法增益", "重新定义玩家BUFF时间格式");
		HTML_LOG("毒药条", "潜行图标进入潜行后更加明显");
		HTML_LOG("队友头像", "修正可能出现的头像混乱问题");
		HTML_LOG("焦点头像", "修正焦点头像双状态显示问题");
		HTML_LOG("多玩魔盒", "微调宠物动作条位置");

		HTML_VER("2011-04-09(3.3.0.38");
		HTML_LOG("多玩移动", "修正变形后无法点击动作条的错误");
		HTML_LOG("多玩移动", "非萨满玩家将不再显示图腾条选项");
		HTML_LOG("头像增强", "队友施法条样式进行了全新的设计");

		HTML_VER("2011-04-09(3.3.0.37");
		HTML_LOG("多玩移动", "优化切换回缺省方案的效果");		

		HTML_VER("2011-04-08(3.3.0.36");
		HTML_LOG("多玩魔盒", "修正使用法术书施法的错误");
		HTML_LOG("头像增强", "将正确显示精英目标连击点");

		HTML_VER("2011-04-08(3.3.0.35");
		HTML_LOG("头像增强", "兼容Xperl等流行头像");
		HTML_LOG("微型菜单", "兼容BT4等流行动作条");		

		HTML_VER("2011-04-08(3.3.0.34");
		HTML_LOG("头像增强", "载具头像现在更加美观");
		HTML_LOG("多玩移动", "修正变形后卡载具问题");		

		HTML_VER("2011-03-31(3.3.0.33");
		HTML_LOG("动作条美化", "修复动作条美化错误");

		HTML_VER("2011-03-31(3.3.0.32)");
		HTML_LOG("多玩移动", "优化多玩移动动作条模块");

		HTML_VER("2011-03-25(3.3.0.31)");
		HTML_LOG("猎人助手", "自动切换追踪现在将正确工作");
		HTML_LOG("猎人助手", "增加眩晕时自动取消豹守功能");

		HTML_VER("2011-03-24(3.3.0.30)");
		HTML_LOG("团队报警器", "更新到最新版本");

		HTML_VER("2011-03-23(3.3.0.29)");
		HTML_LOG("技能触发", "修复可能不显示触发问题");

		HTML_VER("2011-03-19(3.3.0.28)");
		HTML_LOG("图腾助手", "优化SM图腾助手缺省设置");

		HTML_VER("2011-03-17(3.3.0.27)");
		HTML_LOG("技能触发", "修正生命分流不显示问题");

		HTML_VER("2011-03-17(3.3.0.26)");
		HTML_LOG("技能触发", "增加T10套装触发提示");
		HTML_LOG("任务查询", "修正任务查询导致的报错");

		HTML_VER("2011-03-16(3.3.0.25)");
		HTML_LOG("图腾助手", "增加萨满图腾助手模块");

		HTML_VER("2011-03-12(3.3.0.24)");
		HTML_LOG("竞技助手", "增加竞技场被集火通报");
		HTML_LOG("技能触发", "更新技能触发到最新版");

		HTML_VER("2011-03-10(3.3.0.23)");
		HTML_LOG("多玩移动", "修正主动做条的问题");

		HTML_VER("2011-03-10(3.3.0.22)");
		HTML_LOG("多玩魔盒", "改善内存占用情况");

		HTML_VER("2011-03-01(3.3.0.21)");
		HTML_LOG("多玩动作条", "修正缩放定位错误");
		HTML_LOG("多玩动作条", "增加简单的自动对齐功能");
		HTML_LOG("多玩移动", "增加简单的自动对齐功能");

		HTML_VER("2011-03-01(3.3.0.20)");
		HTML_LOG("多玩聊天", "增加Tab键频道切换功能");

		HTML_VER("2011-02-25(3.3.0.19)");
		HTML_LOG("鼠标提示", "距离提示现在将实时刷新");
		HTML_LOG("聊天过滤", "屏蔽世界频道进出消息");

		HTML_VER("2011-02-23(3.3.0.18)");
		HTML_LOG("鼠标提示", "增加目标距离显示项");
		HTML_LOG("法术计时", "完善各职业计时法术");
		HTML_LOG("团队助手", "邀请文字可设为单字");

		HTML_VER("2011-02-17(3.3.0.17)");
		HTML_LOG("随机坐骑", "新增智能随机坐骑宏");
		HTML_LOG("物品信息", "增加镶嵌的宝石信息");

		HTML_VER("2011-02-15(3.3.0.16)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("频道转发", "现在交易频道将正确转发");

		HTML_VER("2011-01-28(3.3.0.15)");
		HTML_LOG("装备信息", "观察窗口添加刷新按键");
		HTML_LOG("竞技语音", "添加竞技场技能语音报警");
		HTML_LOG("任务查询", "可查询低级可接任务信息");

		HTML_VER("2011-01-27(3.3.0.14)");
		HTML_LOG("伤害统计", "盾吸收将正确算入治疗");
		HTML_LOG("装备信息", "修正宝石和天赋显示错误");
		HTML_LOG("拍卖助手", "修正批量购买的错误");

		HTML_VER("2011-01-26(3.3.0.13)");
		HTML_LOG("技能触发", "修正熔火之心不显示问题");

		HTML_VER("2011-01-25(3.3.0.12)");
		HTML_LOG("一键驱散", "更新到最新版本");

		HTML_VER("2011-01-25(3.3.0.11)");
		HTML_LOG("多玩聊天", "修正实名聊天的bug");
		HTML_LOG("伤害统计", "更新到最新版本");

		HTML_VER("2011-01-25(3.3.0.10)");
		HTML_LOG("任务增强", "增加任务小地图标记功能");
		HTML_LOG("任务查询", "缺省不再开启任务查询");
		HTML_LOG("泰坦信息条", "修正可能的不显示问题");

		HTML_VER("2011-01-23(3.3.0.9)");
		HTML_LOG("任务日志", "修正右边区域点击失效问题");
		HTML_LOG("装备信息", "修正宝石镶嵌信息可能错误");
		HTML_LOG("多玩聊天", "修正聊天通道频道切换问题");
		
		HTML_VER("2011-01-23(3.3.0.8)");
		HTML_LOG("物品信息", "添加物品质量显示(色盲辅助)");
		HTML_LOG("密语聊天", "修正密语聊天选项按钮错误");
		HTML_LOG("便捷工具", "恢复好友导入功能");
		HTML_LOG("任务查询", "修正任务查询按钮错位问题");
		HTML_LOG("现行冷却", "没有冷却法术时透明化处理");
		HTML_LOG("首领模块", "首领模块更新到最新版本");

		HTML_VER("2011-01-22(3.3.0.7)");
		HTML_LOG("多玩聊天", "聊天栏现在缺省可互动");
		HTML_LOG("首领模块", "修正奥杜尔本地化错误");
		HTML_LOG("多玩移动", "修正Buff框架移动错误");

		HTML_VER("2011-01-21(3.3.0.6)");
		HTML_LOG("多玩聊天", "增加转发频道屏蔽按键");
		HTML_LOG("多玩魔盒", "调整小地图按键的位置");

		HTML_VER("2011-01-21(3.3.0.5)");
		HTML_LOG("多玩魔盒", "修正系统聊天粘滞的问题");
		HTML_LOG("拍卖助手", "修正拍卖助手已知的错误");
		HTML_LOG("装备掉落", "添加冰冠堡垒新副本掉落");
		HTML_LOG("团队通告", "缺省改为关闭团队通告");

		HTML_VER("2011-01-20(3.3.0.4)");
		HTML_LOG("右键菜单", "添加删除好友等菜单项");
		HTML_LOG("多玩魔盒", "修正聊天输入框的错误");

		HTML_VER("2011-01-20(3.3.0.3)");
		HTML_LOG("随机副本", "不再收起小地图按键");
		HTML_LOG("多玩聊天", "尝试加入交易频道转发");
		HTML_LOG("任务追踪", "增加Shift-左键移动功能");

		HTML_VER("2011-01-20(3.3.0.2)");
		HTML_LOG("地图增强", "修正地图增强的错误");

		HTML_VER("2011-01-19(3.3.0.1)");
		HTML_LOG("多玩魔盒", "全面支持3.3.5国服巫妖王");
		HTML_LOG("首领站位", "移除首领站位模块");
		HTML_LOG("团长助手", "增加团长助手模块");
		HTML_LOG("团长助手", "增加团队通告模块");
		HTML_LOG("多玩聊天", "增加组队频道转发模块");

		HTML_VER("2011-01-09(3.2.0.61)");
		HTML_LOG("金团助手", "增加小队分配报表信息");
		HTML_LOG("法术计时", "补充完善计时法术信息");

		HTML_VER("2011-01-06(3.2.0.60)");
		HTML_LOG("属性报告", "修正天赋显示错误问题");

		HTML_VER("2011-01-06(3.2.0.59)");
		HTML_LOG("金团助手", "修正可能产生混乱的错误");
		HTML_LOG("多玩聊天", "增加玩家属性发送快捷键");
		HTML_LOG("头像增强", "兼容经验条和小德法力条");

		HTML_VER("2010-12-28(3.2.0.58)");
		HTML_LOG("一键施法", "恢复一键施法模块");
		HTML_LOG("多玩符文条", "增加职业模块选项");
		HTML_LOG("伤害输出", "修正治疗爆击显示问题");
		HTML_LOG("鼠标提示", "屏蔽Loading文字提示");

		HTML_VER("2010-12-27(3.2.0.57)");
		HTML_LOG("一键施法", "删除一键施法模块");
		HTML_LOG("施法通告", "删除施法通告模块");
		HTML_LOG("破控警告", "删除破控警告模块");
		HTML_LOG("伤害统计", "修正有时不统计的问题");
		HTML_LOG("装备信息", "修正装备信息显示问题");	

		HTML_VER("2010-12-22(3.2.0.56)");
		HTML_LOG("装备评分", "评分超过7K时修正着色");
		HTML_LOG("头像增强", "增加shift+左键移动功能");
		HTML_LOG("战斗指示", "修正伤害输出治疗问题");
		HTML_LOG("多玩符文条", "对XPerl头像做兼容处理");

		HTML_VER("2010-12-20(3.2.0.55)");
		HTML_LOG("团队框架", "增加阿努巴拉克刺骨治疗模块");

		HTML_VER("2010-12-17(3.2.0.54)");
		HTML_LOG("多玩魔盒", "守护毒药条更名为职业守护条");
		HTML_LOG("战斗指示", "修复战斗伤害信息混乱的问题");
		HTML_LOG("多玩魔盒", "多玩符文条增加对单体的兼容");
		HTML_LOG("泰坦信息条", "尝试修正信件状态延迟问题");

		HTML_VER("2010-12-16(3.2.0.53)");
		HTML_LOG("简易状态", "修正可能出现的定位问题");
		HTML_LOG("战斗指示", "增加DCT的伤害输出模块");
		HTML_LOG("职业辅助", "DK符文条增加移动和缩放功能");
		HTML_LOG("技能冷却", "中心图标增加自定义位置选项");

		HTML_VER("2010-12-15(3.2.0.52)");
		HTML_LOG("简易状态", "增加自定义显示位置功能");
		HTML_LOG("团队框架", "修正不显示预读治疗的Bug");
		HTML_LOG("拍卖助手", "修正缺少库文件引起的错误");

		HTML_VER("2010-12-15(3.2.0.51)");
		HTML_LOG("技能冷却", "关闭可能出现的冷却条");

		HTML_VER("2010-12-14(3.2.0.50)");
		HTML_LOG("简易状态", "重新设计了界面和功能");
		HTML_LOG("金团助手", "增加魔盒金团助手模块");
		HTML_LOG("冷却计时", "增加中心冷却图标选项");

		HTML_VER("2010-12-8(3.2.0.49)");
		HTML_LOG("多玩魔盒", "精简多玩基本库");
		HTML_LOG("装备信息", "补全装备掉落信息");
		HTML_LOG("内置语音", "屏蔽频道菜单和飞机票");
		HTML_LOG("组队语音", "屏蔽自动组队语音功能");

		HTML_VER("2010-11-29(3.2.0.48)");
		HTML_LOG("职业助手", "增加术士恶魔变形法术");

		HTML_VER("2010-11-29(3.2.0.47)");
		HTML_LOG("职业助手", "增加术士召唤动作条");
		HTML_LOG("内置语音", "开放自动组队语音功能");
		HTML_LOG("内置语音", "增加快捷切换频道菜单");
		HTML_LOG("内置语音", "支持 yy://频道ID 链接");
		HTML_LOG("多玩魔盒", "修正盗贼缺省界面载具问题");

		HTML_VER("2010-11-18(3.2.0.46)");
		HTML_LOG("团队助手", "更新团队助手到最新版本");

		HTML_VER("2010-11-18(3.2.0.45)");
		HTML_LOG("团队框架", "缺省将显示团队标记");
		HTML_LOG("密语记录", "添加密语闪烁提示");
		HTML_LOG("NPC标记", "更新NPC数据");
		HTML_LOG("任务查询", "更新任务数据");

		HTML_VER("2010-11-17(3.2.0.44)");
		HTML_LOG("首领站位", "恢复首领站位模块");
		HTML_LOG("副本地图", "添加诺森德地图查询");
		HTML_LOG("自动售卖", "交易后显示售卖获利");
		HTML_LOG("传送门条", "修复传送门条显示bug");

		HTML_VER("2010-11-14(3.2.0.43)");
		HTML_LOG("多玩魔盒", "优化宠物条的外观显示");
		HTML_LOG("毒药守护条", "修正潜行按键错位的bug");

		HTML_VER("2010-11-13(3.2.0.42)");
		HTML_LOG("多玩魔盒", "修正宠物动作条定位的bug");
		HTML_LOG("多玩魔盒", "加强与BT4动作条的兼容性");
		HTML_LOG("聊天泡泡", "增加团队中隐藏的选项");

		HTML_VER("2010-11-11(3.2.0.41)");
		HTML_LOG("多玩魔盒", "修正缺省界面下卡载具的问题");
		HTML_LOG("团队助手", "团队助手更新到国服最新版本");
		
		HTML_VER("2010-11-9(3.2.0.40)");
		HTML_LOG("聊天泡泡", "添加组队聊天泡泡插件");

		HTML_VER("2010-11-5(3.2.0.39)");
		HTML_LOG("属性统计", "修正一处引起报错的BUG");

		HTML_VER("2010-11-4(3.2.0.38)");
		HTML_LOG("魔法增益", "修正系统Buff计时问题");
		HTML_LOG("活动插件", "屏蔽魔枢竞速赛活动插件");

		HTML_VER("2010-11-3(3.2.0.37)");
		HTML_LOG("收支统计", "增加收支统计模块");

		HTML_VER("2010-10-30(3.2.0.36)");
		HTML_LOG("活动插件", "增加保存信息按键");

		HTML_VER("2010-10-29(3.2.0.35)");
		HTML_LOG("竞速比赛", "修正无法上传成绩的错误");
		HTML_LOG("竞速比赛", "原来的比赛数据不会丢失");
		HTML_LOG("竞速比赛", "详情咨询魔盒官方频道YY:23");

		HTML_VER("2010-10-29(3.2.0.34)");
		HTML_LOG("多玩魔盒", "修正竞速赛插件bug");

		HTML_TITLE("更新日志:");
		HTML_VER("2010-10-29(3.2.0.33)");
		HTML_LOG("多玩魔盒", "更新多玩魔枢竞速赛插件");

		HTML_VER("2010-10-26(3.2.0.32)");
		HTML_LOG("多玩DKP", "尝试修正TOC三号不弹框的Bug");
		HTML_LOG("副本掉落", "修正黑龙公主掉落错误");

		HTML_VER("2010-10-21(3.2.0.31)");
		HTML_LOG("NPC标记", "勾选状态将会正确记录");
		HTML_LOG("拍卖助手", "修正一处本地化错误");
		HTML_LOG("商业技能库", "按键布局重新调整");

		HTML_VER("2010-10-19(3.2.0.30)");
		HTML_LOG("拍卖助手", "修正一处本地化错误");

		HTML_VER("2010-10-13(3.2.0.29)");
		HTML_LOG("首领报警", "更新到最新版本");
		HTML_LOG("副本掉落", "更新到最新版本");
		HTML_LOG("泰坦信息条", "添加冬拥湖计时器");
		HTML_LOG("泰坦信息条", "按住Shift点时间调出计时器");
		HTML_LOG("一键换装", "添加按钮数量设置项");

		HTML_VER("2010-10-11(3.2.0.28)");
		HTML_LOG("团队助手", "修正就位检查显示错误");

		HTML_VER("2010-10-10(3.2.0.27)");
		HTML_LOG("聊天增强", "修正解散宠物时聊天栏错位的错误");
		HTML_LOG("技能触发", "修正圣洁护盾计时错误");
		HTML_LOG("技能触发", "添加猛兽攻击触发计时");
		HTML_LOG("团队框架", "修正检查准备显示错误");
		HTML_LOG("法术计时", "修正野蛮咆哮不计时错误");

		HTML_VER("2010-10-1(3.2.0.26)");
		HTML_LOG("多玩菜单栏", "修正不显示多玩菜单栏的Bug");

		HTML_VER("2010-9-29(3.2.0.25)");
		HTML_LOG("背包整理", "修正不能整理银行的Bug");
		HTML_LOG("拍卖助手", "修正右键添加拍卖物品的Bug");

		HTML_VER("2010-9-28(3.2.0.24)");
		HTML_LOG("背包整合", "替换成更好的Combuctor");
		HTML_LOG("团队报警", "更新到国服最新版本");
		HTML_LOG("法术计时器", "补全需要计时的法术");
		HTML_LOG("泰坦信息条", "修正金币统计不保存信息的错误");
		HTML_LOG("首领站位", "添加首领站位插件AVRE");

		HTML_VER("2010-9-26(3.2.0.23)");
		HTML_LOG("物品信息", "装备比较将显示具体的属性点差异");
		HTML_LOG("魔法增益", "自己施放于目标的Buff将更易辨识");
		HTML_LOG("物品信息", "提示中显示不同角色的该物品信息");
		HTML_LOG("焦点头像", "焦点头像的Buff显示更加合理和清晰");

		HTML_VER("2010-9-20(3.2.0.22)");
		HTML_LOG("饰品管理", "修正自动切换马鞭的错误");
		HTML_LOG("拍卖助手", "修正右键使用物品的错误");
		HTML_LOG("物品信息", "修正不显示物品售价的错误");
		HTML_LOG("头像增强", "修正使用载具时引起的错误");

		HTML_VER("2010-9-17(3.2.0.21)");
		HTML_LOG("饰品管理", "修正饰品管理初始化错误");
		HTML_LOG("拍卖助手", "增加批量购买和拍卖功能");

		HTML_VER("2010-9-16(3.2.0.20)");
		HTML_LOG("多玩魔盒", "尝试修复卡动作条的bug");
		HTML_LOG("背包整合", "修正一处可能的语法错误");

		HTML_VER("2010-9-16(3.2.0.19)");
		HTML_LOG("聊天增强", "增加密语聊天模块");

		HTML_VER("2010-9-15(3.2.0.18)");
		HTML_LOG("多玩DKP", "修正多玩DKP已知Bug");
		HTML_LOG("饰品管理", "修正饰品管理菜单错误");

		HTML_VER("2010-9-15(3.2.0.17)");
		HTML_LOG("首领掉落", "添加地图首领掉落查询");
		HTML_LOG("团队框架", "增加点击施法配置选项");
		HTML_LOG("团队框架", "缺省不再进行自动调整");
		HTML_LOG("多玩聊天", "缺省隐藏聊天通道标签");	
		HTML_LOG("拍卖助手", "允许和别的窗口同时打开");	
		HTML_LOG("多玩基本库", "Esc菜单增加魔盒配置项");

		HTML_VER("2010-9-14(3.2.0.16)");
		HTML_LOG("首领模块", "更新首领模块到最新版本");
		HTML_LOG("饰品管理", "拥有了自动排队和缩放等功能");		

		HTML_VER("2010-9-12(3.2.0.15)");
		HTML_LOG("队友Buff", "修复不显示鼠标提示的错误");

		HTML_VER("2010-9-10(3.2.0.14)");
		HTML_LOG("技能触发", "添加移动提示图标位置选项");
		HTML_LOG("商业助手", "添加材料购买数量配置选项");
		HTML_LOG("任务查询", "添加小地图显示任务标记功能");
		HTML_LOG("多玩DKP", "多玩DKP现在可以正常使用了");
		HTML_LOG("背包整合", "修正背包整合不保存位置的错误");
		HTML_LOG("法术计时", "再次补充部分职业需计时法术");
		HTML_LOG("商业技能库", "快捷查询键改为Ctrl + 左键");
		HTML_LOG("聊天增强", "聊天快捷栏支持自定义频道");
		HTML_LOG("多玩动作条", "增加动作条缩放菜单选项");

		HTML_VER("2010-9-7(3.2.0.13)");
		HTML_LOG("多玩基本库", "修正团队分页翻页问题");
		HTML_LOG("聊天增强", "重新调整聊天输入框位置");
		HTML_LOG("多玩移动", "添加对萨满图腾条的支持");

		HTML_VER("2010-9-7(3.2.0.12)");
		HTML_LOG("职业辅助", "添加猎人追踪自动切换功能");
		HTML_LOG("拍卖助手", "添加物品查询记录菜单");
		HTML_LOG("聊天增强", "重新布置聊天输入框位置");
		HTML_LOG("团队框架", "增加治疗预读信息提示");
		HTML_LOG("任务增强", "去掉任务通告中的[魔盒]字样");
		HTML_LOG("聊天增强", "尝试修复人物等级错误问题");

		HTML_VER("2010-9-5(3.2.0.11)");
		HTML_LOG("任务增强", "补全鼠标任务提示功能");

		HTML_VER("2010-9-5(3.2.0.10)");
		HTML_LOG("任务增强", "任务追踪改为左对齐方式");

		HTML_VER("2010-9-4(3.2.0.9)");
		HTML_LOG("法术计时器", "修正图腾计时错误");

		HTML_TITLE("更新日志:");
		HTML_VER("2010-9-4(3.2.0.8)");
		HTML_LOG("毒药条", "修正盗贼毒药显示不完全的错误");
		HTML_LOG("毒药条", "拥有和姿态条相同的快捷键");
		HTML_LOG("简易状态", "优化目标魔法值显示效果");
		HTML_LOG("头像增强", "微调玩家3D头像边框效果");
		HTML_LOG("魔法增益", "修正队友魔法增益不消失bug");
		HTML_LOG("法术计时器", "补充大量计时法术");

		HTML_VER("2010-9-3(3.2.0.7)");
		HTML_LOG("任务查询", "修正追踪窗口错位的bug");
		HTML_LOG("聊天增强", "修正聊天窗口和毒药条位置冲突的问题");

		HTML_VER("2010-9-2(3.2.0.6)");
		HTML_LOG("任务查询", "任务追踪可以查询结束NPC了");
		HTML_LOG("任务增强", "修正任务日志点击错乱的bug");

		HTML_VER("2010-9-1(3.2.0.5)");
		HTML_LOG("队友Buff", "增益魔法中增加开启选项");
		HTML_LOG("任务助手", "弹出菜单改为Shift+右键");

		HTML_VER("2010-9-1(3.2.0.4)");
		HTML_LOG("任务查询", "增加大脚任务查询方式选项");

		HTML_VER("2010-9-1(3.2.0.3)");
		HTML_LOG("任务追踪", "修正个别出现无法追踪的错误");
		HTML_LOG("任务查询", "数字按钮将同时查询结束NPC");

		HTML_VER("2010-8-31(3.2.0.2)");
		HTML_LOG("任务查询", "添加任务查询数据");

		HTML_VER("2010-8-31(3.2.0.1)");
		HTML_LOG("多玩魔盒", "全面支持国服巫妖王");

		HTML_VER("2010-8-29(3.1.0.35)");
		HTML_LOG("头像增强", "修正3D头像显示不正确的问题");

		HTML_VER("2010-8-28(3.1.0.34)");
		HTML_LOG("聊天增强", "修正无法关闭聊天通道的错误");
		HTML_LOG("拍卖助手", "修正不显示拍卖行价格的错误");
		HTML_LOG("线性冷却", "修正无法正确关闭的错误");
		HTML_LOG("背包整合", "交易时将自动打开背包了");
		HTML_LOG("冷却计时", "超出距离染色将正确的渲染了");

		HTML_VER("2010-8-26(3.1.0.33)");
		HTML_LOG("聊天增强", "添加交易和综合等快捷键");
		HTML_LOG("聊天增强", "切换频道后原文字将会保留");
		HTML_LOG("多玩动作条", "修正多玩动作条关闭的错误");
		HTML_LOG("制作增强", "制作界面添加切换标签");

		HTML_VER("2010-8-26(3.1.0.32)");
		HTML_LOG("采集助手", "修正采集助手引起的报错");
		HTML_LOG("团队框架", "将正确的显示怒气和能量了");
		HTML_LOG("插件分类", "所有插件重新进行详细的分类");
		
		HTML_VER("2010-8-24(3.1.0.31)");
		HTML_LOG("仇恨统计", "修复仇恨统计不显示的错误");
		HTML_LOG("多玩移动", "修复无法移动宠物条的错误");

		HTML_VER("2010-8-23(3.1.0.30)");
		HTML_LOG("战场助手", "修复战斗助手配置失效的bug");
		HTML_LOG("多玩基本库", "修正游戏中无法观看过场动画的错误");
		HTML_LOG("法术计时器", "添加盗贼毒药计时, 修正切割计时");
		HTML_LOG("泰坦信息条", "兼容小地图自定义");
		HTML_LOG("动作条皮肤", "修正缺省界面换肤的问题");
		HTML_LOG("任务增强", "进入副本将自动最小化追踪窗口");
		HTML_LOG("鼠标提示", "修正冬握湖城墙生命不显示的问题");
		HTML_LOG("饰品管理", "添加快速按键绑定功能");
		HTML_LOG("快捷菜单栏", "增加多玩快捷菜单栏");
		HTML_LOG("头像增强", "增加宠物头像扩展");
		HTML_LOG("宠物条", "宠物条将自适应毒药条移动");
		HTML_LOG("地图增强", "增加地图增强插件Mapster");
		HTML_LOG("任务查询", "全面支持国服版巫妖王");
		HTML_LOG("一键换装", "修正团队中隐藏引起的逻辑错误");
		HTML_LOG("泰坦信息条", "邮件助手不再隐藏小地图提示");
		HTML_LOG("任务追踪", "全面改进任务追踪");

		HTML_VER("2010-7-30(3.1.0.29)");
		HTML_LOG("团队报警", "修复团队报警报错");
		HTML_LOG("仇恨统计", "修复仇恨统计报错");

		HTML_VER("2010-7-30(3.1.0.28)");
		HTML_LOG("所有插件", "与台服版本同步");

		HTML_VER("2010-7-6(3.1.0.27)");
		HTML_LOG("多玩基本库", "修正可能出现的bug");

		HTML_VER("2010-7-5(3.1.0.26)");
		HTML_LOG("多玩基本库", "修复战斗结束后卡机的bug");
		HTML_LOG("多玩移动", "修复多玩移动保存配置的bug");	
		HTML_LOG("多玩动作条", "修正无法使用装备宏的bug");	

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒药守护条", "重新实现后不再卡机");	

		HTML_VER("2010-6-9(3.1.0.24)");
		HTML_LOG("首领模块", "修复DBM战场模块BUG");	

		HTML_VER("2010-5-31(3.1.0.23)");
		HTML_LOG("错误提示", "屏蔽错误提示弹出");	
		HTML_LOG("配置界面", "美化设置界面");	

		HTML_VER("2010-5-12(3.1.0.22)");
		HTML_LOG("副本掉落", "修复副本掉落查询的错误");	
		HTML_LOG("毒药守护条", "暂时屏蔽毒药姿态条");	

		HTML_VER("2010-5-12(3.1.0.21)");
		HTML_LOG("自动购买", "修复自动购买引起的报错");	
		HTML_LOG("基本库", "再次打开配置时显示关闭前的界面");	

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("职业辅助", "法师拥有了传送姿态条");

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("职业辅助", "潜行者拥有了毒药姿态条");	
		HTML_LOG("爱心功能", "添加很有爱心的双采工具");
		HTML_LOG("调试信息", "关闭团队插件时不再报错");
		HTML_LOG("伤害输出", "基本伤害输出能正常关闭了");
		HTML_LOG("仇恨统计", "修正仇恨统计的细微BUG");
		HTML_LOG("字体相关", "物品数量字体更易辨识");
		HTML_LOG("猎人助手", "喂食宠物进度条将正常显示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移动", "不再会出现堆栈溢出了");
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近战进度条", "添加近战进度条模块");
		HTML_LOG("拍卖助手", "新增防一口价防伪功能");
		HTML_LOG("杂项改动", "精简ACE库以减少资源占用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移动", "修正已知的全部问题");	
		HTML_LOG("多玩移动", "配置界面不会跑出屏幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移动", "修正潜行结束后的BUG");	
		HTML_LOG("首领模块", "汉化部分toc信息");

		HTML_VER("2010-4-23(3.1.0.14)");
		HTML_LOG("多玩移动", "修正切换形态时报错");	
		HTML_LOG("多玩移动", "修正控制怪物时报错");
		HTML_LOG("多玩移动", "感谢炽火提供的帮助");		

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移动", "修正菜单条消失BUG");	
		HTML_LOG("银行整合", "银行整合可以交换物品了");
		HTML_LOG("首领模块", "现在可以加载TBC模块了");
		HTML_LOG("战斗指示", "添加伤害输出项(系统功能)");
		HTML_LOG("聊天增强", "增加一个聊天通道分页");
		HTML_LOG("拾取模块", "添加自动拾取项(系统功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移动", "修正锁定后界面移位BUG");
		HTML_LOG("多玩移动", "缩放的时候窗口不再移动");
		
		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移动", "界面移动现在可以使用了");
		HTML_LOG("聊天增强", "修正聊天分页引起的BUG");
		HTML_LOG("团队模块", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移动", "新增界面移动功能");
		HTML_LOG("交易增强", "修正值发送密语的错误");
		HTML_LOG("施法计时", "现在可以正确的显示时间了");
		HTML_LOG("一键换装", "新增一键换装模块");
		HTML_LOG("首领模块", "改为更好用的DBM");
		HTML_LOG("聊天增强", "修正分页重叠的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("猎人助手", "守护条载入时将正确显示");
		HTML_LOG("施法计时", "修正施法计时的nil报错");
		HTML_LOG("背包整合", "增加拖动改变排列功能");
		HTML_LOG("模块命名", "各个模块的命名更加易懂");
		HTML_LOG("聊天增强", "增加聊天自动分页功能");
		HTML_LOG("交易增强", "你可以选择通报的频道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("猎人助手", "修复因本地化信息报错");
		HTML_LOG("插件管理", "左上角增加额外提示信息");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("头像增强", "现在队友头像扩展可以关闭了");
		HTML_LOG("战斗指示器", "加入预设特效法术报警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省关闭");
		HTML_LOG("多玩动作条", "支持转换天赋时切换技能");
		HTML_LOG("多玩动作条", "Shift+右键取消法术设置");
		HTML_LOG("多玩动作条", "增加按键绑定功能");
		HTML_LOG("人物属性", "人物属性面板显示维修费用");
		HTML_LOG("延迟施法条", "加入施法剩余时间显示");	

		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("团队插件", "增加团队插件标签");
		HTML_LOG("团队插件", "现在有了快捷的配置");
		HTML_LOG("仇恨统计", "跟/show说拜拜吧");
		HTML_LOG("伤害统计", "跟仇恨统计握手吧");
		HTML_LOG("团队报警", "增加RaidAlerter利器");
		HTML_LOG("猎人助手", "增加自动射击计时条");
		HTML_LOG("任务增强", "修正LinkButton报错");
		HTML_LOG("图腾助手", "图腾条缺省可以施法了");
		HTML_LOG("DCT", "删除伤害输出模块");
		HTML_LOG("ACE库", "修正属性统计逻辑错误");

		HTML_VER("2010-4-4(3.1.0.5)");
		HTML_LOG("多玩动作条", "紧急修复Push报错");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日志", "点击版本号可查看更新日志");
		HTML_LOG("鼠标提示", "增加副天赋信息显示");
		HTML_LOG("杂项改动", "在toc中加入多玩插件标志");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增强地图", "汉化地图上按键信息");
		HTML_LOG("基本库", "动态载入插件现在将正确触发");
		HTML_LOG("猎人模块", "增加守护动作条");
		HTML_LOG("背包整理", "按键提示文字改为系统风格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字体显示");
		HTML_LOG("商业技能库", "去掉toc里多余的依赖标签");
		HTML_LOG("基本库", "团队插件后加上相应的英文名");
		HTML_LOG("多玩动作条", "增加宏、坐骑等支持");
		HTML_LOG("多玩动作条", "取消法术时将拾取该法术");
		HTML_LOG("多玩动作条", "修正消耗品数量提示BUG");
		HTML_LOG("任务增强", "右击小绿点可折叠任务追踪");
		HTML_LOG("拍卖助手", "修正版本信息错误");
		HTML_LOG("任务增强", "分解为战场和竞技场模块");
		HTML_LOG("聊天助手", "恢复系统的频道记录习惯");
	HTML_END();	
elseif (GetLocale() == "zhTW") then
	HTML_BEGIN();
		HTML_TITLE("更新日誌:");

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒藥守護條", "重新實現後不再卡機");

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("職業輔助", "法師擁有了傳送姿態條");	

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("職業輔助", "潛行者擁有了毒藥姿態條");	
		HTML_LOG("愛心功能", "添加很有愛心的雙采工具");
		HTML_LOG("調試資訊", "關閉團隊插件時不再報錯");
		HTML_LOG("傷害輸出", "基本傷害輸出能正常關閉了");
		HTML_LOG("仇恨統計", "修正仇恨統計的細微BUG");
		HTML_LOG("字體相關", "物品數量字體更易辨識");
		HTML_LOG("獵人助手", "餵食寵物進度條將正常顯示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移動", "不再會出現堆疊溢位了");	
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近戰進度條", "添加近戰進度條模組");
		HTML_LOG("拍賣助手", "新增防一口價防偽功能");
		HTML_LOG("雜項改動", "精簡ACE庫以減少資源佔用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移動", "修正已知的全部問題");	
		HTML_LOG("多玩移動", "配置介面不會跑出螢幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移動", "修正潛行結束後的BUG");	
		HTML_LOG("首領模組", "漢化部分toc資訊");

		HTML_VER("2010-4-24(3.1.0.14)");
		HTML_LOG("多玩移動", "修正切換形態時報錯");	
		HTML_LOG("多玩移動", "修正控制怪物時報錯");
		HTML_LOG("多玩移動", "感謝熾火提供的幫助");	

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移動", "修正菜單條消失BUG");	
		HTML_LOG("銀行整合", "銀行整合可以交換物品了");
		HTML_LOG("首領模組", "現在可以載入TBC模組了");
		HTML_LOG("戰鬥指示", "添加傷害輸出項(系統功能)");
		HTML_LOG("聊天增強", "增加一個聊天通道分頁");
		HTML_LOG("拾取模組", "添加自動拾取項(系統功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移動", "修正鎖定後介面移位元BUG");
		HTML_LOG("多玩移動", "縮放的時候視窗不再移動");

		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移動", "介面移動現在可以使用了");
		HTML_LOG("聊天增強", "修正聊天分頁引起的BUG");
		HTML_LOG("團隊模組", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移動", "新增介面移動功能");
		HTML_LOG("交易增強", "修正值發送密語的錯誤");
		HTML_LOG("施法計時", "現在可以正確的顯示時間了");
		HTML_LOG("一鍵換裝", "新增一鍵換裝模組");
		HTML_LOG("首領模組", "改為更好用的DBM");
		HTML_LOG("聊天增強", "修正分頁重疊的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("獵人助手", "守護條載入時將正確顯示");
		HTML_LOG("施法計時", "修正施法計時的nil報錯");
		HTML_LOG("背包整合", "增加拖動改變排列功能");
		HTML_LOG("模組命名", "各個模組的命名更加易懂");
		HTML_LOG("聊天增強", "增加聊天自動分頁功能");
		HTML_LOG("交易增強", "你可以選擇通報的頻道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("獵人助手", "修復因本地化資訊報錯");
		HTML_LOG("插件管理", "左上角增加額外提示資訊");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("頭像增強", "現在隊友頭像擴展可以關閉了");
		HTML_LOG("戰鬥指示器", "加入預設特效法術報警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省關閉");
		HTML_LOG("多玩動作條", "支援轉換天賦時切換技能");
		HTML_LOG("多玩動作條", "Shift+右鍵取消法術設置");
		HTML_LOG("多玩動作條", "增加按鍵綁定功能");
		HTML_LOG("人物屬性", "人物屬性面板顯示維修費用");
		HTML_LOG("延遲施法條", "加入施法剩餘時間顯示");	
		
		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("團隊插件", "增加團隊插件標籤");
		HTML_LOG("團隊插件", "現在有了快捷的配置");
		HTML_LOG("仇恨統計", "跟/show說拜拜吧");
		HTML_LOG("傷害統計", "跟仇恨統計握手吧");
		HTML_LOG("團隊報警", "增加RaidAlerter利器");
		HTML_LOG("獵人助手", "增加自動射擊計時條");
		HTML_LOG("任務增強", "修正LinkButton報錯");
		HTML_LOG("圖騰助手", "圖騰條缺省可以施法了");
		HTML_LOG("DCT", "刪除傷害輸出模組");
		HTML_LOG("ACE庫", "修正屬性統計邏輯錯誤");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日誌", "點擊版本號可查看更新日誌");
		HTML_LOG("滑鼠提示", "增加副天賦資訊顯示");
		HTML_LOG("雜項改動", "在toc中加入多玩插件標誌");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增強地圖", "漢化地圖上按鍵資訊");
		HTML_LOG("基本庫", "動態載入插件現在將正確觸發");
		HTML_LOG("獵人模組", "增加守護動作條");
		HTML_LOG("背包整理", "按鍵提示文字改為系統風格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字體顯示");
		HTML_LOG("商業技能庫", "去掉toc裏多餘的依賴標籤");
		HTML_LOG("基本庫", "團隊插件後加上相應的英文名");
		HTML_LOG("多玩動作條", "增加宏、坐騎等支援");
		HTML_LOG("多玩動作條", "取消法術時將拾取該法術");
		HTML_LOG("多玩動作條", "修正消耗品數量提示BUG");
		HTML_LOG("任務增強", "右擊小綠點可折疊任務追蹤");
		HTML_LOG("拍賣助手", "修正版本資訊錯誤");
		HTML_LOG("任務增強", "分解為戰場和競技場模組");
		HTML_LOG("聊天助手", "恢復系統的頻道記錄習慣");
	HTML_END();	
end