------------------------------------------------------------------------------------------
-- ChangeLog ver 1.0
-- 日期: 2010-4-3
-- 作者: dugu@bigfoot
-- 描述: 多玩魔盒更新日志信息(简体中文)
-- 版权所有 (c) duowan.com
------------------------------------------------------------------------------------------
DUOWAN_CHANGELOG = "";

function HTML_BEGIN()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<HTML><BODY>";
end

function HTML_TITLE(txt)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H1>" .. txt .. "</H1>";
end

function HTML_VER(ver)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<H2>" .. ver .. "</H2>";
end

function HTML_SPACE()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG .. "<BR/>";
end

function HTML_LOG(head, desc)
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "<P>|cff00e0e0" .. head .. ": |R" .. desc .. "</P>";
end

function HTML_END()
	DUOWAN_CHANGELOG = DUOWAN_CHANGELOG ..  "</BODY></HTML>";
end


if (GetLocale() == "zhCN") then
	HTML_BEGIN();
		HTML_TITLE("更新日志:");
		HTML_VER("2010-9-1(3.2.0.3)");
		HTML_LOG("任务追踪", "修正个别出现无法追踪的错误");
		HTML_LOG("任务查询", "数字按钮将同时查询结束NPC");

		HTML_VER("2010-8-31(3.2.0.2)");
		HTML_LOG("任务查询", "添加任务查询数据");

		HTML_VER("2010-8-31(3.2.0.1)");
		HTML_LOG("多玩魔盒", "全面支持国服巫妖王");

		HTML_VER("2010-8-29(3.1.0.35)");
		HTML_LOG("头像增强", "修正3D头像显示不正确的问题");

		HTML_VER("2010-8-28(3.1.0.34)");
		HTML_LOG("聊天增强", "修正无法关闭聊天通道的错误");
		HTML_LOG("拍卖助手", "修正不显示拍卖行价格的错误");
		HTML_LOG("线性冷却", "修正无法正确关闭的错误");
		HTML_LOG("背包整合", "交易时将自动打开背包了");
		HTML_LOG("冷却计时", "超出距离染色将正确的渲染了");

		HTML_VER("2010-8-26(3.1.0.33)");
		HTML_LOG("聊天增强", "添加交易和综合等快捷键");
		HTML_LOG("聊天增强", "切换频道后原文字将会保留");
		HTML_LOG("多玩动作条", "修正多玩动作条关闭的错误");
		HTML_LOG("制作增强", "制作界面添加切换标签");

		HTML_VER("2010-8-26(3.1.0.32)");
		HTML_LOG("采集助手", "修正采集助手引起的报错");
		HTML_LOG("团队框架", "将正确的显示怒气和能量了");
		HTML_LOG("插件分类", "所有插件重新进行详细的分类");
		
		HTML_VER("2010-8-24(3.1.0.31)");
		HTML_LOG("仇恨统计", "修复仇恨统计不显示的错误");
		HTML_LOG("多玩移动", "修复无法移动宠物条的错误");

		HTML_VER("2010-8-23(3.1.0.30)");
		HTML_LOG("战场助手", "修复战斗助手配置失效的bug");
		HTML_LOG("多玩基本库", "修正游戏中无法观看过场动画的错误");
		HTML_LOG("法术计时器", "添加盗贼毒药计时, 修正切割计时");
		HTML_LOG("泰坦信息条", "兼容小地图自定义");
		HTML_LOG("动作条皮肤", "修正缺省界面换肤的问题");
		HTML_LOG("任务增强", "进入副本将自动最小化追踪窗口");
		HTML_LOG("鼠标提示", "修正冬握湖城墙生命不显示的问题");
		HTML_LOG("饰品管理", "添加快速按键绑定功能");
		HTML_LOG("快捷菜单栏", "增加多玩快捷菜单栏");
		HTML_LOG("头像增强", "增加宠物头像扩展");
		HTML_LOG("宠物条", "宠物条将自适应毒药条移动");
		HTML_LOG("地图增强", "增加地图增强插件Mapster");
		HTML_LOG("任务查询", "全面支持国服版巫妖王");
		HTML_LOG("一键换装", "修正团队中隐藏引起的逻辑错误");
		HTML_LOG("泰坦信息条", "邮件助手不再隐藏小地图提示");
		HTML_LOG("任务追踪", "全面改进任务追踪");

		HTML_VER("2010-7-30(3.1.0.29)");
		HTML_LOG("团队报警", "修复团队报警报错");
		HTML_LOG("仇恨统计", "修复仇恨统计报错");

		HTML_VER("2010-7-30(3.1.0.28)");
		HTML_LOG("所有插件", "与台服版本同步");

		HTML_VER("2010-7-6(3.1.0.27)");
		HTML_LOG("多玩基本库", "修正可能出现的bug");

		HTML_VER("2010-7-5(3.1.0.26)");
		HTML_LOG("多玩基本库", "修复战斗结束后卡机的bug");
		HTML_LOG("多玩移动", "修复多玩移动保存配置的bug");	
		HTML_LOG("多玩动作条", "修正无法使用装备宏的bug");	

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒药守护条", "重新实现后不再卡机");	

		HTML_VER("2010-6-9(3.1.0.24)");
		HTML_LOG("首领模块", "修复DBM战场模块BUG");	

		HTML_VER("2010-5-31(3.1.0.23)");
		HTML_LOG("错误提示", "屏蔽错误提示弹出");	
		HTML_LOG("配置界面", "美化设置界面");	

		HTML_VER("2010-5-12(3.1.0.22)");
		HTML_LOG("副本掉落", "修复副本掉落查询的错误");	
		HTML_LOG("毒药守护条", "暂时屏蔽毒药姿态条");	

		HTML_VER("2010-5-12(3.1.0.21)");
		HTML_LOG("自动购买", "修复自动购买引起的报错");	
		HTML_LOG("基本库", "再次打开配置时显示关闭前的界面");	

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("职业辅助", "法师拥有了传送姿态条");	

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("职业辅助", "潜行者拥有了毒药姿态条");	
		HTML_LOG("爱心功能", "添加很有爱心的双采工具");
		HTML_LOG("调试信息", "关闭团队插件时不再报错");
		HTML_LOG("伤害输出", "基本伤害输出能正常关闭了");
		HTML_LOG("仇恨统计", "修正仇恨统计的细微BUG");
		HTML_LOG("字体相关", "物品数量字体更易辨识");
		HTML_LOG("猎人助手", "喂食宠物进度条将正常显示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移动", "不再会出现堆栈溢出了");	
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近战进度条", "添加近战进度条模块");
		HTML_LOG("拍卖助手", "新增防一口价防伪功能");
		HTML_LOG("杂项改动", "精简ACE库以减少资源占用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移动", "修正已知的全部问题");	
		HTML_LOG("多玩移动", "配置界面不会跑出屏幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移动", "修正潜行结束后的BUG");	
		HTML_LOG("首领模块", "汉化部分toc信息");

		HTML_VER("2010-4-23(3.1.0.14)");
		HTML_LOG("多玩移动", "修正切换形态时报错");	
		HTML_LOG("多玩移动", "修正控制怪物时报错");
		HTML_LOG("多玩移动", "感谢炽火提供的帮助");		

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移动", "修正菜单条消失BUG");	
		HTML_LOG("银行整合", "银行整合可以交换物品了");
		HTML_LOG("首领模块", "现在可以加载TBC模块了");
		HTML_LOG("战斗指示", "添加伤害输出项(系统功能)");
		HTML_LOG("聊天增强", "增加一个聊天通道分页");
		HTML_LOG("拾取模块", "添加自动拾取项(系统功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移动", "修正锁定后界面移位BUG");
		HTML_LOG("多玩移动", "缩放的时候窗口不再移动");
		
		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移动", "界面移动现在可以使用了");
		HTML_LOG("聊天增强", "修正聊天分页引起的BUG");
		HTML_LOG("团队模块", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移动", "新增界面移动功能");
		HTML_LOG("交易增强", "修正值发送密语的错误");
		HTML_LOG("施法计时", "现在可以正确的显示时间了");
		HTML_LOG("一键换装", "新增一键换装模块");
		HTML_LOG("首领模块", "改为更好用的DBM");
		HTML_LOG("聊天增强", "修正分页重叠的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("猎人助手", "守护条载入时将正确显示");
		HTML_LOG("施法计时", "修正施法计时的nil报错");
		HTML_LOG("背包整合", "增加拖动改变排列功能");
		HTML_LOG("模块命名", "各个模块的命名更加易懂");
		HTML_LOG("聊天增强", "增加聊天自动分页功能");
		HTML_LOG("交易增强", "你可以选择通报的频道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("猎人助手", "修复因本地化信息报错");
		HTML_LOG("插件管理", "左上角增加额外提示信息");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("头像增强", "现在队友头像扩展可以关闭了");
		HTML_LOG("战斗指示器", "加入预设特效法术报警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省关闭");
		HTML_LOG("多玩动作条", "支持转换天赋时切换技能");
		HTML_LOG("多玩动作条", "Shift+右键取消法术设置");
		HTML_LOG("多玩动作条", "增加按键绑定功能");
		HTML_LOG("人物属性", "人物属性面板显示维修费用");
		HTML_LOG("延迟施法条", "加入施法剩余时间显示");	

		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("团队插件", "增加团队插件标签");
		HTML_LOG("团队插件", "现在有了快捷的配置");
		HTML_LOG("仇恨统计", "跟/show说拜拜吧");
		HTML_LOG("伤害统计", "跟仇恨统计握手吧");
		HTML_LOG("团队报警", "增加RaidAlerter利器");
		HTML_LOG("猎人助手", "增加自动射击计时条");
		HTML_LOG("任务增强", "修正LinkButton报错");
		HTML_LOG("图腾助手", "图腾条缺省可以施法了");
		HTML_LOG("DCT", "删除伤害输出模块");
		HTML_LOG("ACE库", "修正属性统计逻辑错误");

		HTML_VER("2010-4-4(3.1.0.5)");
		HTML_LOG("多玩动作条", "紧急修复Push报错");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日志", "点击版本号可查看更新日志");
		HTML_LOG("鼠标提示", "增加副天赋信息显示");
		HTML_LOG("杂项改动", "在toc中加入多玩插件标志");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增强地图", "汉化地图上按键信息");
		HTML_LOG("基本库", "动态载入插件现在将正确触发");
		HTML_LOG("猎人模块", "增加守护动作条");
		HTML_LOG("背包整理", "按键提示文字改为系统风格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字体显示");
		HTML_LOG("商业技能库", "去掉toc里多余的依赖标签");
		HTML_LOG("基本库", "团队插件后加上相应的英文名");
		HTML_LOG("多玩动作条", "增加宏、坐骑等支持");
		HTML_LOG("多玩动作条", "取消法术时将拾取该法术");
		HTML_LOG("多玩动作条", "修正消耗品数量提示BUG");
		HTML_LOG("任务增强", "右击小绿点可折叠任务追踪");
		HTML_LOG("拍卖助手", "修正版本信息错误");
		HTML_LOG("任务增强", "分解为战场和竞技场模块");
		HTML_LOG("聊天助手", "恢复系统的频道记录习惯");
	HTML_END();	
elseif (GetLocale() == "zhTW") then
	HTML_BEGIN();
		HTML_TITLE("更新日誌:");

		HTML_VER("2010-6-17(3.1.0.25)");
		HTML_LOG("毒藥守護條", "重新實現後不再卡機");

		HTML_VER("2010-5-10(3.1.0.20)");
		HTML_LOG("毒药守护条", "尝试修复卡机的问题");	
		HTML_LOG("自动购买", "加入自动购买施法材料的功能");	
		HTML_LOG("基本库", "更新Ace库版本");	

		HTML_VER("2010-5-3(3.1.0.19)");
		HTML_LOG("職業輔助", "法師擁有了傳送姿態條");	

		HTML_VER("2010-4-30(3.1.0.18)");
		HTML_LOG("職業輔助", "潛行者擁有了毒藥姿態條");	
		HTML_LOG("愛心功能", "添加很有愛心的雙采工具");
		HTML_LOG("調試資訊", "關閉團隊插件時不再報錯");
		HTML_LOG("傷害輸出", "基本傷害輸出能正常關閉了");
		HTML_LOG("仇恨統計", "修正仇恨統計的細微BUG");
		HTML_LOG("字體相關", "物品數量字體更易辨識");
		HTML_LOG("獵人助手", "餵食寵物進度條將正常顯示");

		HTML_VER("2010-4-29(3.1.0.17)");
		HTML_LOG("多玩移動", "不再會出現堆疊溢位了");	
		HTML_LOG("多玩DKP", "加入多玩原DKP插件");
		HTML_LOG("近戰進度條", "添加近戰進度條模組");
		HTML_LOG("拍賣助手", "新增防一口價防偽功能");
		HTML_LOG("雜項改動", "精簡ACE庫以減少資源佔用");

		HTML_VER("2010-4-24(3.1.0.16)");
		HTML_LOG("多玩移動", "修正已知的全部問題");	
		HTML_LOG("多玩移動", "配置介面不會跑出螢幕了");

		HTML_VER("2010-4-23(3.1.0.15)");
		HTML_LOG("多玩移動", "修正潛行結束後的BUG");	
		HTML_LOG("首領模組", "漢化部分toc資訊");

		HTML_VER("2010-4-24(3.1.0.14)");
		HTML_LOG("多玩移動", "修正切換形態時報錯");	
		HTML_LOG("多玩移動", "修正控制怪物時報錯");
		HTML_LOG("多玩移動", "感謝熾火提供的幫助");	

		HTML_VER("2010-4-23(3.1.0.13)");
		HTML_LOG("多玩移動", "修正菜單條消失BUG");	
		HTML_LOG("銀行整合", "銀行整合可以交換物品了");
		HTML_LOG("首領模組", "現在可以載入TBC模組了");
		HTML_LOG("戰鬥指示", "添加傷害輸出項(系統功能)");
		HTML_LOG("聊天增強", "增加一個聊天通道分頁");
		HTML_LOG("拾取模組", "添加自動拾取項(系統功能)");

		HTML_VER("2010-4-22(3.1.0.12)");
		HTML_LOG("多玩移動", "修正鎖定後介面移位元BUG");
		HTML_LOG("多玩移動", "縮放的時候視窗不再移動");

		HTML_VER("2010-4-22(3.1.0.11)");
		HTML_LOG("多玩移動", "介面移動現在可以使用了");
		HTML_LOG("聊天增強", "修正聊天分頁引起的BUG");
		HTML_LOG("團隊模組", "修正DBM引起的BUG");

		HTML_VER("2010-4-20(3.1.0.10)");
		HTML_LOG("多玩移動", "新增介面移動功能");
		HTML_LOG("交易增強", "修正值發送密語的錯誤");
		HTML_LOG("施法計時", "現在可以正確的顯示時間了");
		HTML_LOG("一鍵換裝", "新增一鍵換裝模組");
		HTML_LOG("首領模組", "改為更好用的DBM");
		HTML_LOG("聊天增強", "修正分頁重疊的BUG");

		HTML_VER("2010-4-15(3.1.0.9)");
		HTML_LOG("獵人助手", "守護條載入時將正確顯示");
		HTML_LOG("施法計時", "修正施法計時的nil報錯");
		HTML_LOG("背包整合", "增加拖動改變排列功能");
		HTML_LOG("模組命名", "各個模組的命名更加易懂");
		HTML_LOG("聊天增強", "增加聊天自動分頁功能");
		HTML_LOG("交易增強", "你可以選擇通報的頻道了");

		HTML_VER("2010-4-10(3.1.0.8)");
		HTML_LOG("獵人助手", "修復因本地化資訊報錯");
		HTML_LOG("插件管理", "左上角增加額外提示資訊");

		HTML_VER("2010-4-8(3.1.0.7)");
		HTML_LOG("頭像增強", "現在隊友頭像擴展可以關閉了");
		HTML_LOG("戰鬥指示器", "加入預設特效法術報警");
		HTML_LOG("特效指示器", "加入EventAlert, 缺省關閉");
		HTML_LOG("多玩動作條", "支援轉換天賦時切換技能");
		HTML_LOG("多玩動作條", "Shift+右鍵取消法術設置");
		HTML_LOG("多玩動作條", "增加按鍵綁定功能");
		HTML_LOG("人物屬性", "人物屬性面板顯示維修費用");
		HTML_LOG("延遲施法條", "加入施法剩餘時間顯示");	
		
		HTML_VER("2010-4-6(3.1.0.6)");
		HTML_LOG("團隊插件", "增加團隊插件標籤");
		HTML_LOG("團隊插件", "現在有了快捷的配置");
		HTML_LOG("仇恨統計", "跟/show說拜拜吧");
		HTML_LOG("傷害統計", "跟仇恨統計握手吧");
		HTML_LOG("團隊報警", "增加RaidAlerter利器");
		HTML_LOG("獵人助手", "增加自動射擊計時條");
		HTML_LOG("任務增強", "修正LinkButton報錯");
		HTML_LOG("圖騰助手", "圖騰條缺省可以施法了");
		HTML_LOG("DCT", "刪除傷害輸出模組");
		HTML_LOG("ACE庫", "修正屬性統計邏輯錯誤");

		HTML_VER("2010-4-4(3.1.0.4)");
		HTML_LOG("更新日誌", "點擊版本號可查看更新日誌");
		HTML_LOG("滑鼠提示", "增加副天賦資訊顯示");
		HTML_LOG("雜項改動", "在toc中加入多玩插件標誌");

		HTML_VER("2010-4-3(3.1.0.3)");
		HTML_LOG("增強地圖", "漢化地圖上按鍵資訊");
		HTML_LOG("基本庫", "動態載入插件現在將正確觸發");
		HTML_LOG("獵人模組", "增加守護動作條");
		HTML_LOG("背包整理", "按鍵提示文字改為系統風格");
		HTML_LOG("聊天助手", "聊天框文字以缺省字體顯示");
		HTML_LOG("商業技能庫", "去掉toc裏多餘的依賴標籤");
		HTML_LOG("基本庫", "團隊插件後加上相應的英文名");
		HTML_LOG("多玩動作條", "增加宏、坐騎等支援");
		HTML_LOG("多玩動作條", "取消法術時將拾取該法術");
		HTML_LOG("多玩動作條", "修正消耗品數量提示BUG");
		HTML_LOG("任務增強", "右擊小綠點可折疊任務追蹤");
		HTML_LOG("拍賣助手", "修正版本資訊錯誤");
		HTML_LOG("任務增強", "分解為戰場和競技場模組");
		HTML_LOG("聊天助手", "恢復系統的頻道記錄習慣");
	HTML_END();	
end